base/0_initial/fields/H2O
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// #include "../system/case_InternalField.setup"

dimensions      [0 0 0 0 0 0 0];

// internalField   ${:internalField.nonuniform.H2O};
internalField   uniform 0.0;

boundaryField
{
  ".*WW.*"
    {
        type            zeroGradient;
    }
".*SYM.*"
  {
    type            symmetryPlane;
  }
}


// ************************************************************************* //
