base/0_initial/fields/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1000.0;

boundaryField
{
  ".*WW.*"
    {
      type            fixedValue;
        value           uniform 1000.0;
    }
".*SYM.*"
  {
    type            symmetryPlane;
  }
}


// ************************************************************************* //

// -0.593969849246,382470.663188,30436.048317,30436.048317,0.01
// -0.587939698492,634263.849787,50473.1134591,50473.1134591,0.01
// -0.581909547739,634263.849787,50473.1134591,50473.1134591,0.01
// -0.575879396985,634263.849787,50473.1134591,50473.1134591,0.01
// -0.569849246231,634263.849787,50473.1134591,50473.1134591,0.01
// -0.563819095477,634263.849787,50473.1134591,50473.1134591,0.01
// -0.557788944724,634263.849787,50473.1134591,50473.1134591,0.01
