base/0_initial/other_fields/IDefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      IDefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../system/case.setup"

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform ${:internalField_IDefault};

boundaryField
{

  ${:DefaultFIRE.boundaryField.IDefault};
  ${:boundaryField.IDefault};
    // frontAndBack
    // {
    //     type            empty;
    // }
}

// ************************************************************************* //
