base/0_initial/other_fields/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ydefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../system/case.setup"

dimensions      [0 0 0 0 0 0 0];

//internalField   uniform 0;
internalField   uniform ${:internalField_Ydefault};

boundaryField
{
  ${:DefaultFIRE.boundaryField.Ydefault};
  ${:boundaryField.Ydefault};
}


// ************************************************************************* //
