base/0_initial/other_fields/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../system/case.setup"
dimensions      [1 -1 -1 0 0 0 0];

internalField  uniform ${:internalField_alphat};

boundaryField
{
  ${:DefaultFIRE.boundaryField.alphat};
  ${:boundaryField.alphat};
    // "(outlet|sides)"
    // {
    //     type            zeroGradient;
    // }

    // base
    // {
    //     type            zeroGradient;
    // }

    // inlet
    // {
    //     type            zeroGradient;
    // }

    // frontAndBack
    // {
    //     type            empty;
    // }
}


// ************************************************************************* //
