base/0_initial/other_fields/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../system/case.setup"
dimensions      [0 2 -2 0 0 0 0];

//internalField   uniform 1e-4;
internalField   uniform ${:internalField_k};

boundaryField
{
  ${:DefaultFIRE.boundaryField.k};
  ${:boundaryField.k};
    // "(outlet|sides)"
    // {
    //     type            inletOutlet;
    //     inletValue      $internalField;
    //     value           $internalField;
    // }

    // sides
    // {
    //     type            inletOutlet;
    //     inletValue      uniform 1e-4;
    //     value           uniform 1e-4;
    // }

    // base
    // {
    //     type            zeroGradient;
    // }

    // inlet
    // {
    //     type            fixedValue;
    //     value           $internalField;
    // }

    // frontAndBack
    // {
    //     type            empty;
    // }
}


// ************************************************************************* //
