base/0_initial/other_fields/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../system/case.setup"

dimensions      [0 2 -1 0 0 0 0];

//internalField   uniform 0;
internalField  uniform ${:internalField_nut};

boundaryField
{
  ${:DefaultFIRE.boundaryField.nut};
  ${:boundaryField.nut};
    // "(outlet|sides)"
    // {
    //     type            zeroGradient;
    // }

    // base
    // {
    //     type            zeroGradient;
    // }

    // inlet
    // {
    //     type            zeroGradient;
    // }

    // frontAndBack
    // {
    //     type            empty;
    // }
}


// ************************************************************************* //
