base/0_initial/other_fields/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../system/case.setup"

dimensions      [1 -1 -2 0 0 0 0];

//internalField   uniform 0;
internalField   uniform ${:internalField_p_rgh};

boundaryField
{
  ${:DefaultFIRE.boundaryField.p_rgh};
  ${:boundaryField.p_rgh};
}


// ************************************************************************* //
