base/0_initial/other_fields/ph_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ph_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../system/case.setup"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  ${:DefaultFIRE.boundaryField.ph_rgh_orig};
  ${:boundaryField.ph_rgh_orig};
}


// ************************************************************************* //
