base/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         singleStepReactingMixture;
    //mixture         multiComponentMixture;
    transport       sutherland;
    //transport       const;
    thermo          janaf;
    //thermo          hConst;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
//hePsiThermo  multiComponentMixture      const       hConst  perfectGas       specie  sensibleEnthalpy

}

species
(
    O2
    H2O
    C2H4
    CO2
    N2
);

inertSpecie N2;

O2
{
    specie
    {
        molWeight       31.9988;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 3.69758 0.00061352 -1.25884e-07 1.77528e-11 -1.13644e-15 -1233.93 3.18917 );
        lowCpCoeffs     ( 3.21294 0.00112749 -5.75615e-07 1.31388e-09 -8.76855e-13 -1005.25 6.03474 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

H2O
{
    specie
    {
        molWeight       18.0153;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.67215 0.00305629 -8.73026e-07 1.201e-10 -6.39162e-15 -29899.2 6.86282 );
        lowCpCoeffs     ( 3.38684 0.00347498 -6.3547e-06 6.96858e-09 -2.50659e-12 -30208.1 2.59023 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

// C2H4 // achtung falsch!!!!! das ist CH4
// {
//   //[[file:~/10_TOOLs/CFD/OPF/ESI/OpenFOAM-v2006/etc/thermoData/therm.dat::C2H4 g 1/00C 2.H 4. 0. 0.G 200.000 6000.000 1000. 1][therm.dat]]
//   // C2H4              g 1/00C  2.H  4.   0.   0.G   200.000  6000.000 1000.        1
//   //   3.99182724E+00 1.04833908E-02-3.71721342E-06 5.94628366E-10-3.53630386E-14    2
//   //   4.26865851E+03-2.69081762E-01 3.95920063E+00-7.57051373E-03 5.70989993E-05    3
//   //   -6.91588352E-08 2.69884190E-11 5.08977598E+03 4.09730213E+00 6.31426266E+03    4
//   specie
//     {
//       molWeight       16.0428;
//     }
//   thermodynamics
//     {
//       Tlow            200;
//       Thigh           6000;
//       Tcommon         1000;
//       highCpCoeffs    ( 1.63543 0.0100844 -3.36924e-06 5.34973e-10 -3.15528e-14 -10005.6 9.9937 );
//       lowCpCoeffs     ( 5.14988 -0.013671 4.91801e-05 -4.84744e-08 1.66694e-11 -10246.6 -4.64132 );
//     }
//   transport
//     {
//       As              1.67212e-06;
//       Ts              170.672;
//     }
// }

C2H4
{
  specie
    {
      molWeight       28.0542;
    }
  thermodynamics
    {
      Tlow            200;
      Thigh           6000;
      Tcommon         1000;
      highCpCoeffs    ( 3.99183 0.0104834 -3.71721e-06 5.94628e-10 -3.5363e-14 4268.66 -0.269082 );
      lowCpCoeffs     ( 3.9592 -0.00757051 5.7099e-05 -6.91588e-08 2.69884e-11 5089.78 4.0973 );
    }

  // transport  // noch wrong!!! (sutherland for viscosity)
  //   {
  //     As              1.67212e-06;
  //     Ts              170.672;
  //   }
  transport  // based con cantera - Karhtik's python script 2021
  {
      As 1.624534615985844e-06;
      Ts 214.9062554864484;
  }

}

//CH4
//{
//  // CH4    RRHO       g 8/99C  1.H  4.   0.   0.G   200.000  6000.000 1000.        1
//  //   1.91178600E+00 9.60267960E-03-3.38387841E-06 5.38797240E-10-3.19306807E-14    2
//  //   -1.00992136E+04 8.48241861E+00 5.14825732E+00-1.37002410E-02 4.93749414E-05    3
//  //   -4.91952339E-08 1.70097299E-11-1.02453222E+04-4.63322726E+00-8.97226656E+03    4
//  //   CH4   ANHARMONIC  g 8/99C  1.H  4.   0.   0.G   200.000  6000.000 1000.        1
//  //   1.65326226E+00 1.00263099E-02-3.31661238E-06 5.36483138E-10-3.14696758E-14    2
//  //   -1.00095936E+04 9.90506283E+00 5.14911468E+00-1.36622009E-02 4.91453921E-05    3
//  //   -4.84246767E-08 1.66603441E-11-1.02465983E+04-4.63848842E+00-8.97226656E+03    4
//    specie
//    {
//        molWeight       16.0428;
//    }
//    thermodynamics
//    {
//        Tlow            200;
//        Thigh           6000;
//        Tcommon         1000;
//        highCpCoeffs    ( 1.63543 0.0100844 -3.36924e-06 5.34973e-10 -3.15528e-14 -10005.6 9.9937 );
//        lowCpCoeffs     ( 5.14988 -0.013671 4.91801e-05 -4.84744e-08 1.66694e-11 -10246.6 -4.64132 );
//    }
//    transport
//    {
//        As              1.67212e-06;
//        Ts              170.672;
//    }
//}

CO // wrong CO2
{
    specie
    {
        molWeight       44.01;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 4.45362 0.00314017 -1.27841e-06 2.394e-10 -1.66903e-14 -48967 -0.955396 );
        lowCpCoeffs     ( 2.27572 0.00992207 -1.04091e-05 6.86669e-09 -2.11728e-12 -48373.1 10.1885 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}
CO2
{
    specie
    {
        molWeight       44.01;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 4.45362 0.00314017 -1.27841e-06 2.394e-10 -1.66903e-14 -48967 -0.955396 );
        lowCpCoeffs     ( 2.27572 0.00992207 -1.04091e-05 6.86669e-09 -2.11728e-12 -48373.1 10.1885 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

N2
{
    specie
    {
        molWeight       28.0134;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.92664 0.00148798 -5.68476e-07 1.0097e-10 -6.75335e-15 -922.798 5.98053 );
        lowCpCoeffs     ( 3.29868 0.00140824 -3.96322e-06 5.64152e-09 -2.44486e-12 -1020.9 3.95037 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}
fuel        C2H4;

chemistryReader foamChemistryReader;

foamChemistryFile "<constant>/reactions";

foamChemistryThermoFile "<constant>/thermo.compressibleGas";


// ************************************************************************* //
